update roofcalculation docs
